system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         40000;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // massfraction
    // {
    //     type            scalarTransport;
    //     libs            ("libsolverFunctionObjects.so");
    //     field           s;
    // 	phi             phi;
    //     D               1.45e-9;
    // }

   #includeFunc pressureDifferencePatch 
   #includeFunc flowRatePatch(name=inlet)
   #includeFunc flowRatePatch(name=membrane)
   #includeFunc residuals
    
}

// ************************************************************************* //
